base/Documents/бит_ФормаСбораДанных.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>бит_ФормаСбораДанных</Name>
			<BasedOn>
				<xr:Item>Catalog.бит_ВидыФормСбораДанных</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccountingRegister.бит_Дополнительный_4</xr:Item>
				<xr:Item>AccumulationRegister.бит_ОборотыПоБюджетам</xr:Item>
				<xr:Item>AccountingRegister.бит_Дополнительный_3</xr:Item>
				<xr:Item>AccountingRegister.бит_Дополнительный_1</xr:Item>
				<xr:Item>AccountingRegister.Хозрасчетный</xr:Item>
				<xr:Item>AccumulationRegister.бит_СоответствиеОборотовТрансляции</xr:Item>
				<xr:Item>AccumulationRegister.бит_ОборотыПоТипамПроводок</xr:Item>
				<xr:Item>AccumulationRegister.бит_ОборотыПроизвольныхПараметров</xr:Item>
				<xr:Item>AccountingRegister.бит_Бюджетирование</xr:Item>
				<xr:Item>AccountingRegister.бит_Дополнительный_5</xr:Item>
				<xr:Item>AccountingRegister.бит_Дополнительный_2</xr:Item>
				<xr:Item>InformationRegister.бит_ЗначенияПроизвольныхПараметров</xr:Item>
				<xr:Item>InformationRegister.бит_СоответствиеЗаписейТрансляции</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НомерПроформы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидФормыСбораДанных</Name>
					<Comment>Вид формы сбора данных</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ВидыФормСбораДанных</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВалютаДокумента</Name>
					<Comment>Валюта документа</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КурсДокумента</Name>
					<Comment>Курс документа</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КратностьДокумента</Name>
					<Comment>Кратность документа</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Comment>Пользователь, ответственный за заполнение данного документа</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Комментарий</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Comment>Сумма документа</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РучнаяКорректировка</Name>
					<Comment>Ручная корректировка (служебный реквизит)</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтразитьВЗакрытомПериоде</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДанныеШапки</Name>
					<Comment>Данные шапки</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИмяРеквизита</Name>
							<Comment>Имя реквизита</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеРеквизита</Name>
							<Comment>Значение реквизита</Comment>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:TypeSet>cfg:AnyIBRef</v8:TypeSet>
								<v8:NumberQualifiers>
									<v8:Digits>19</v8:Digits>
									<v8:FractionDigits>6</v8:FractionDigits>
								</v8:NumberQualifiers>
								<v8:StringQualifiers>
									<v8:Length>250</v8:Length>
								</v8:StringQualifiers>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДанныеТабличныхЧастей</Name>
					<Comment>Данные табличных частей</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИмяТабличнойЧасти</Name>
							<Comment>Имя табличной части</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерСтрокиТаблицы</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИмяРеквизита</Name>
							<Comment>Имя реквизита</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеРеквизита</Name>
							<Comment>Значение реквизита</Comment>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:TypeSet>cfg:AnyIBRef</v8:TypeSet>
								<v8:NumberQualifiers>
									<v8:Digits>19</v8:Digits>
									<v8:FractionDigits>6</v8:FractionDigits>
								</v8:NumberQualifiers>
								<v8:StringQualifiers>
									<v8:Length>250</v8:Length>
								</v8:StringQualifiers>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

base/InformationRegisters/бит_ДанныеТабличныхЧастейПроформ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>бит_ДанныеТабличныхЧастейПроформ</Name>
			<Comment>(БИТ)</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ЗначениеРеквизита</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:TypeSet>cfg:AnyIBRef</v8:TypeSet>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Проформа</Name>
					<Comment>Проформа</Comment>
					<Type>
						<v8:TypeSet>cfg:DefinedType.бит_ОбъектыПроформ</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИмяТабличнойЧасти</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НомерСтрокиТаблицы</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИмяРеквизита</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

base/Documents/бит_ФормаСбораДанных/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий
	
Процедура ПриЗаписи(Отказ)
		
	Если ОбменДанными.Загрузка Тогда
		Возврат;			
	КонецЕсли; 
	
	НаборДанные = РегистрыСведений.бит_ДанныеТабличныхЧастейПроформ.СоздатьНаборЗаписей();
	НаборДанные.Отбор.Проформа.Использование = Истина;
	НаборДанные.Отбор.Проформа.ВидСравнения  = ВидСравнения.Равно;
	НаборДанные.Отбор.Проформа.Значение      = Ссылка;
	
	Если ДополнительныеСвойства.Свойство("ДанныеТабличныхЧастей") 
		И ТипЗнч(ДополнительныеСвойства.ДанныеТабличныхЧастей) = Тип("ТаблицаЗначений") Тогда
		
		// Запись данных табличных частей в регистр сведений.
        ДополнительныеСвойства.ДанныеТабличныхЧастей.ЗаполнитьЗначения(Ссылка, "Проформа");		
		НаборДанные.Загрузить(ДополнительныеСвойства.ДанныеТабличныхЧастей);
		бит_ОбщегоНазначения.ЗаписатьНаборЗаписейРегистра(НаборДанные,"Ошибки");		
		
	Иначе	
		
		// Очистка регистра с данными табличных частей, т.к. для данной проформы данные хранятся непосредственно в документе.
		НаборДанные.Прочитать();
		
		Если НаборДанные.Количество() > 0 Тогда
			
			НаборДанные.Очистить();
			бит_ОбщегоНазначения.ЗаписатьНаборЗаписейРегистра(НаборДанные,"Ошибки");
			
		КонецЕсли; 
		
	КонецЕсли; 
	
КонецПроцедуры // ПриЗаписи()

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	// Проверка ручной корректировки.
	Если бит_ОбщегоНазначения.РучнаяКорректировкаОбработкаПроведения(РучнаяКорректировка, Отказ, "", ЭтотОбъект, Ложь) Тогда
		Возврат
	КонецЕсли;	
	
	ПсевдоМета      = бит_РаботаСПроизвольнымиФормами.ЭмулироватьМетаданные(ВидФормыСбораДанных);
	ДанныеДокумента = Документы.бит_ФормаСбораДанных.ПодготовитьДанныеДокумента(Ссылка);
	
	ДополнительныеСвойства.Вставить("бит_ДанныеДокумента", ДанныеДокумента);
	
	ПроверкаЗаполненияПроформы(ПсевдоМета, ДанныеДокумента, Отказ);
	
	Документы.бит_ФормаСбораДанных.ЗаполнитьПриемникиПроформы(ЭтотОбъект);
    
КонецПроцедуры // ОбработкаПроведения()

Процедура ПриКопировании(ОбъектКопирования)
	
	Ответственный = Пользователи.ТекущийПользователь();
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	ВалютаДокумента = Константы.ВалютаРегламентированногоУчета.Получить();
	КурсДокумента      = 1;
	КратностьДокумента = 1;
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("СправочникСсылка.бит_ВидыФормСбораДанных") Тогда
		ВидФормыСбораДанных = ДанныеЗаполнения;		
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("Структура") Тогда
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеЗаполнения);
	КонецЕсли; 
	
	Ответственный = Пользователи.ТекущийПользователь();
	
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	
	бит_ОбщегоНазначения.УдалитьДвиженияРегистратора(ЭтотОбъект, Отказ, РучнаяКорректировка);
	
КонецПроцедуры // ОбработкаУдаленияПроведения()

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ПроверкаЗаполненияПроформы(ПсевдоМета, ДанныеДокумента, Отказ)

	// Проверка заполнения реквизитов шапки
	Для каждого МетаРеквизит Из ПсевдоМета.Реквизиты Цикл
		
		Если МетаРеквизит.ПроверкаЗаполнения И НЕ ЗначениеЗаполнено(ДанныеДокумента[МетаРеквизит.Имя]) Тогда
			
			ТекстСообщения = НСтр("ru='Не заполнено значение реквизита ""%1"".';
								  |en='Value of detail ""%1"" is empty'");
			ТекстСообщения = СтрШаблон(ТекстСообщения, МетаРеквизит.Синоним);
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,, "Шапка_" + МетаРеквизит.Имя);
			Отказ = Истина;
			
		КонецЕсли; 
		
	КонецЦикла; // ПсевдоМета.Реквизиты
	
	// Проверка заполнения реквизитов табличных частей.
	Для каждого КиЗ Из ПсевдоМета.ТабличныеЧасти Цикл
		
		МетаТабЧасть = КиЗ.Значение;
		
		Если НЕ ДанныеДокумента.Свойство(МетаТабЧасть.Имя) Тогда		
			Продолжить;		
		КонецЕсли; 
		
		ТабЧасть = ДанныеДокумента[МетаТабЧасть.Имя];
		
		Сч = 1;
		Для каждого СтрокаТаблицы Из ТабЧасть Цикл
			
			Для каждого МетаРеквизит Из МетаТабЧасть.Реквизиты Цикл
				
				ЗначениеДляПроверки = СтрокаТаблицы[МетаРеквизит.Имя];				
				Если МетаРеквизит.ПроверкаЗаполнения И НЕ ЗначениеЗаполнено(ЗначениеДляПроверки) Тогда					
					ТекстСообщения = НСтр("ru='Не заполнено значение реквизита ""%1"" в строке ""%2"" табличной части ""%3"".';
										  |en='Value is not filled props ""%1"" in the string ""%2"" tables of ""%3"".'");
					ТекстСообщения = СтрШаблон(ТекстСообщения, МетаРеквизит.Синоним, Строка(Сч), МетаТабЧасть.Синоним);
					ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
					Отказ = Истина;					
				КонецЕсли; 
				
			КонецЦикла;  // МетаТабЧасть.Реквизиты
			
			Сч = Сч+1;
		КонецЦикла; 
		
	КонецЦикла; // ПсевдоМета.ТабличныеЧасти

КонецПроцедуры // ПроверкаЗаполненияПроформы()

#КонецОбласти

#Иначе
  ВызватьИсключение НСтр("ru='Недопустимый вызов объекта на клиенте.';en='Invalid object call on client'");
#КонецЕсли
